
[
  {
    "CompanyName": "Tech Solutions Ltd.",
    "CompanyLocation": "Cairo, Egypt",
    "CompanyImage": "images/companies/techsolutions.jpg",
    "Website": "https://techsolutions.com",
    "Industry": "Software Development",
    "CompanyDescription": "We build innovative software products that help businesses streamline operations, enhance user experiences, and stay ahead in the digital world. Our team is dedicated to delivering high-quality, scalable, and secure software tailored to our clients' unique needs.",
    "CompanyMission": "Empowering businesses with technology by providing smart, efficient, and cutting-edge software solutions. We aim to foster innovation, drive digital transformation, and create lasting impact through our products and services.",
    "EmployeeRange": "[100 - 150]",
    "EstablishedYear": 2010,
    "UserEmail": "employer1@example.com"
  },
  {
    "CompanyName": "Innovatech Systems",
    "CompanyLocation": "Alexandria, Egypt",
    "CompanyImage": "images/companies/innovatech.png",
    "Website": "https://innovatechsystems.com",
    "Industry": "IT Services",
    "CompanyDescription": "Innovatech provides cutting-edge IT solutions for enterprises, helping them optimize operations, enhance customer engagement, and embrace digital transformation. Our expert teams deliver tailored solutions that align with business goals.",
    "CompanyMission": "To empower organizations through reliable and scalable technology services. We aim to build long-term partnerships by delivering innovative solutions that add real value.",
    "EmployeeRange": "[50 - 100]",
    "EstablishedYear": 2015,
    "UserEmail": "employer2@example.com"
  },
  {
    "CompanyName": "GreenByte Technologies",
    "CompanyLocation": "Giza, Egypt",
    "CompanyImage": "images/companies/greenbyte.jpg",
    "Website": "https://greenbyte-tech.com",
    "Industry": "Green Tech",
    "CompanyDescription": "GreenByte focuses on developing sustainable technology solutions that reduce environmental impact. From energy-efficient systems to smart agriculture, we build for a better future.",
    "CompanyMission": "To lead the way in sustainable innovation by integrating environmental consciousness into every tech solution we develop.",
    "EmployeeRange": "[30 - 60]",
    "EstablishedYear": 2018,
    "UserEmail": "employer3@example.com"
  },
  {
    "CompanyName": "Finovate Egypt",
    "CompanyLocation": "Nasr City, Cairo, Egypt",
    "CompanyImage": "images/companies/finovate.jpg",
    "Website": "https://finovate-eg.com",
    "Industry": "FinTech",
    "CompanyDescription": "Finovate is revolutionizing digital banking and financial services in Egypt through innovative platforms that prioritize security, speed, and user experience. We collaborate with major banks and startups alike.",
    "CompanyMission": "To reshape the financial landscape by making financial services accessible, intelligent, and secure for everyone.",
    "EmployeeRange": "[80 - 120]",
    "EstablishedYear": 2012,
    "UserEmail": "employer4@example.com"
  },
  {
    "CompanyName": "Emirates Digital Hub",
    "CompanyLocation": "Dubai, United Arab Emirates",
    "CompanyImage": "images/companies/emiratesdigital.png",
    "Website": "https://emiratesdigitalhub.ae",
    "Industry": "Digital Transformation",
    "CompanyDescription": "Emirates Digital Hub is a leading provider of digital transformation solutions for government and enterprise sectors. Our focus is on smart city technologies, cloud services, and AI-powered applications.",
    "CompanyMission": "To drive the UAE’s vision of becoming a global leader in digital innovation by providing world-class technological infrastructure and intelligent digital services.",
    "EmployeeRange": "[200 - 300]",
    "EstablishedYear": 2008,
    "UserEmail": "employer5@example.com"
  },
  {
    "CompanyName": "ByteForge GmbH",
    "CompanyLocation": "Berlin, Germany",
    "CompanyImage": "images/companies/byteforge.jpg",
    "Website": "https://byteforge.de",
    "Industry": "Software Engineering",
    "CompanyDescription": "ByteForge is a German software engineering firm specializing in high-performance systems, DevOps automation, and open-source contributions. We partner with clients across Europe to build robust digital products.",
    "CompanyMission": "To engineer reliable, scalable, and maintainable software solutions that meet the evolving needs of modern businesses and support open innovation in the tech ecosystem.",
    "EmployeeRange": "[60 - 90]",
    "EstablishedYear": 2011,
    "UserEmail": "employer6@example.com"
  }
]
